TransactionStore.Api.Tests/TestData/test-incorrect.xml

<Transactions>
<Transaction id="Inv00001">
<TransactionDate>2019-01-23T13:45:10</TransactionDate>
<PaymentDetails>
<Amount></Amount>
<CurrencyCode>USD</CurrencyCode>
</PaymentDetails>
<Status>Done</Status>
</Transaction>
<Transaction id="Inv00002">
<TransactionDate>2019-01-24T16:09:15</TransactionDate>
<PaymentDetails>
<Amount>300</Amount>
<CurrencyCode>USFD</CurrencyCode>
</PaymentDetails>
<Status>Rejected</Status>
</Transaction>
</Transactions>